app/Http/Controllers/Test/Crud/CrudTestController.php

    public function index()
    {
        $categorias = TipoProducto::all();
---
select * from `tipoproducto`

    public function edit($idTipoProducto)
    {
        $tipo_producto = TipoProducto::where('idTipoProducto', $idTipoProducto)->first();
---
select * from `tipoproducto` where `idTipoProducto` = '1' limit 1